Revit 2024 API
BuiltInFailures.MEPFabricationFailures.FabricationPartHasInvalidGeometry Property
 The fabrication part either has no material or has badly configured dimensions, resulting in bad geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabricationPartHasInvalidGeometry { get; }
Visual Basic
Public Shared ReadOnly Property FabricationPartHasInvalidGeometry As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabricationPartHasInvalidGeometry {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace